In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as pp
%matplotlib inline

In [202]:
import urllib.request
import os.path
import zipfile

data_url = "https://www.ssa.gov/oact/babynames/state/namesbystate.zip"
local_filename = "babynamesbystate.zip"
if not os.path.exists(local_filename): # if the data exists don't download again
    with urllib.request.urlopen(data_url) as resp, open(local_filename, 'wb') as f:
        f.write(resp.read())

zf = zipfile.ZipFile(local_filename, 'r')

st_name = ['NH.TXT', 'MA.TXT',  'ME.TXT', 'VT.TXT']
field_names = ['State', 'Gender', 'Year', 'Name', 'Count']
babynames = pd.DataFrame()

for st in st_name:
    with zf.open(st) as fh:
        st_babynames = pd.read_csv(fh, header=None, names=field_names)
        babynames = pd.concat([babynames, st_babynames])

babynames.sample(10)

       State Gender  Year        Name  Count
55589     MA      F  2006    Giovanna     18
101112    MA      M  1992      Edison      5
21786     VT      M  1965      Thomas     72
2684      VT      F  1931      Claire     18
45073     MA      F  1994     Lyndsey     19
112482    MA      M  2009     Branden      7
29759     ME      M  1921   Ellsworth      7
46028     MA      F  1995  Franchesca     11
14472     MA      F  1946     Corrine     13
9287      MA      F  1933      Miriam     36

In [203]:
babynames_index = babynames.set_index(['Name','State','Year']).sort_index()

In [204]:
babynames_index.index

MultiIndex([( 'Aaden', 'MA', 2008),
            ( 'Aaden', 'MA', 2009),
            ( 'Aaden', 'MA', 2012),
            ( 'Aaden', 'ME', 2009),
            ('Aadhya', 'MA', 2013),
            ('Aadhya', 'MA', 2014),
            ('Aadhya', 'MA', 2015),
            ('Aadhya', 'MA', 2016),
            ('Aadhya', 'MA', 2018),
            ('Aadhya', 'MA', 2019),
            ...
            (  'Zuri', 'MA', 2018),
            (  'Zuri', 'MA', 2019),
            (  'Zuri', 'MA', 2020),
            ( 'Zyair', 'MA', 2020),
            ('Zyaire', 'MA', 2016),
            ('Zyaire', 'MA', 2018),
            ('Zyaire', 'MA', 2019),
            ('Zyaire', 'MA', 2020),
            ( 'Zylah', 'MA', 2020),
            (  'Zyon', 'MA', 2013)],
           names=['Name', 'State', 'Year'], length=242303)

In [205]:
babynames_index

                  Gender  Count
Name   State Year
Aaden  MA    2008      M     10
             2009      M     25
             2012      M      5
       ME    2009      M      5
Aadhya MA    2013      F      8
...                  ...    ...
Zyaire MA    2018      M      5
             2019      M      6
             2020      M     10
Zylah  MA    2020      F      5
Zyon   MA    2013      M      6

[242303 rows x 2 columns]

In [206]:
babynames_index.loc[('Bruce','ME')]

     Gender  Count
Year
1917      M      5
1918      M      6
1923      M      5
1924      M     12
1925      M      8
...     ...    ...
1991      M     12
1992      M      8
1994      M      5
1995      M      5
1998      M      5

[75 rows x 2 columns]

In [207]:
babynames_index.loc[('Bruce',slice(None),1960)]

                 Gender  Count
Name  State Year
Bruce MA    1960      M    405
      ME    1960      M    127
      NH    1960      M     59
      VT    1960      M     43

In [208]:
babynames_index.loc[('Bruce','ME')]['Count'].sum()

3843

In [209]:
babynames_index.loc[('Bruce','ME'),:].max()

Gender      M
Count     156
dtype: object

In [210]:
babynames_index.swaplevel('Name', 'State').sort_index()

                  Gender  Count
State Name   Year
MA    Aaden  2008      M     10
             2009      M     25
             2012      M      5
      Aadhya 2013      F      8
             2014      F      7
...                  ...    ...
VT    Zoey   2014      F     10
             2015      F     10
             2016      F     12
             2017      F      8
             2020      F      9

[242303 rows x 2 columns]

In [154]:
babynames_index.sum(level="Name")

         Count
Name
Aaden       45
Aadhya      50
Aadi         5
Aadya       29
Aaliyah   1825
...        ...
Zuri        48
Zyair        6
Zyaire      28
Zylah        5
Zyon         6

[5639 rows x 1 columns]

In [211]:
babynames_index = babynames.set_index(['Name','State','Year','Gender']).sort_index()
babynames_index

                          Count
Name   State Year Gender
Aaden  MA    2008 M          10
             2009 M          25
             2012 M           5
       ME    2009 M           5
Aadhya MA    2013 F           8
...                         ...
Zyaire MA    2018 M           5
             2019 M           6
             2020 M          10
Zylah  MA    2020 F           5
Zyon   MA    2013 M           6

[242303 rows x 1 columns]

In [212]:
babynames_index = babynames_index.unstack()
babynames_index

                  Count
Gender                F     M
Name   State Year
Aaden  MA    2008   NaN  10.0
             2009   NaN  25.0
             2012   NaN   5.0
       ME    2009   NaN   5.0
Aadhya MA    2013   8.0   NaN
...                 ...   ...
Zyaire MA    2018   NaN   5.0
             2019   NaN   6.0
             2020   NaN  10.0
Zylah  MA    2020   5.0   NaN
Zyon   MA    2013   NaN   6.0

[237485 rows x 2 columns]

In [213]:
babynames_index = babynames_index.unstack()
babynames_index

             Count                                               ...       \
Gender           F                                               ...    M
Year          1910 1911 1912 1913 1914 1915 1916 1917 1918 1919  ... 2011
Name   State                                                     ...
Aaden  MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
       ME      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
Aadhya MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
Aadi   MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
Aadya  MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
...            ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...
Zuri   MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
Zyair  MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
Zyaire MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
Zylah  MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
Zyon   MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN


Gender
Year         2012 2013 2014 2015 2016 2017 2018 2019  2020
Name   State
Aaden  MA     5.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN   NaN
       ME     NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   NaN
Aadhya MA     NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   NaN
Aadi   MA     NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   NaN
Aadya  MA     NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   NaN
...           ...  ...  ...  ...  ...  ...  ...  ...   ...
Zuri   MA     NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   NaN
Zyair  MA     NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   6.0
Zyaire MA     NaN  NaN  NaN  NaN  7.0  NaN  5.0  6.0  10.0
Zylah  MA     NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   NaN
Zyon   MA     NaN  6.0  NaN  NaN  NaN  NaN  NaN  NaN   NaN

[11030 rows x 222 columns]

In [214]:
babynames_index.loc[('Bruce')]

       Count                                               ...             \
Gender     F                                               ...     M
Year    1910 1911 1912 1913 1914 1915 1916 1917 1918 1919  ...  2011 2012
State                                                      ...
MA       NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  12.0  6.0
ME       NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...   NaN  NaN
NH       NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...   NaN  NaN
VT       NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...   NaN  NaN


Gender
Year   2013 2014 2015 2016 2017  2018 2019 2020
State
MA      9.0  8.0  5.0  6.0  7.0  12.0  9.0  9.0
ME      NaN  NaN  NaN  NaN  NaN   NaN  NaN  NaN
NH      NaN  NaN  NaN  NaN  NaN   NaN  NaN  NaN
VT      NaN  NaN  NaN  NaN  NaN   NaN  NaN  NaN

[4 rows x 222 columns]

In [218]:
babynames_index = babynames.set_index(['State','Name','Year'],drop=False).sort_index()
babynames_index

                  State Gender  Year    Name  Count
State Name   Year
MA    Aaden  2008    MA      M  2008   Aaden     10
             2009    MA      M  2009   Aaden     25
             2012    MA      M  2012   Aaden      5
      Aadhya 2013    MA      F  2013  Aadhya      8
             2014    MA      F  2014  Aadhya      7
...                 ...    ...   ...     ...    ...
VT    Zoey   2014    VT      F  2014    Zoey     10
             2015    VT      F  2015    Zoey     10
             2016    VT      F  2016    Zoey     12
             2017    VT      F  2017    Zoey      8
             2020    VT      F  2020    Zoey      9

[242303 rows x 5 columns]

In [219]:
bruce_bn = babynames_index[babynames_index["Name"]=="Bruce"]
bruce_bn

                 State Gender  Year   Name  Count
State Name  Year
MA    Bruce 1911    MA      M  1911  Bruce      5
            1912    MA      M  1912  Bruce      6
            1913    MA      M  1913  Bruce      5
            1914    MA      M  1914  Bruce      6
            1915    MA      M  1915  Bruce      5
...                ...    ...   ...    ...    ...
VT    Bruce 1984    VT      M  1984  Bruce      5
            1985    VT      M  1985  Bruce      5
            1986    VT      M  1986  Bruce      5
            1988    VT      M  1988  Bruce      6
            1989    VT      M  1989  Bruce      6

[313 rows x 5 columns]

In [220]:
babynames_index = babynames_index.unstack()
babynames_index

ValueError: Index contains duplicate entries, cannot reshape

In [225]:
babynames_index = babynames.set_index(['State','Name','Year', 'Gender'],drop=False).sort_index()
babynames_index

                         State Gender  Year    Name  Count
State Name   Year Gender
MA    Aaden  2008 M         MA      M  2008   Aaden     10
             2009 M         MA      M  2009   Aaden     25
             2012 M         MA      M  2012   Aaden      5
      Aadhya 2013 F         MA      F  2013  Aadhya      8
             2014 F         MA      F  2014  Aadhya      7
...                        ...    ...   ...     ...    ...
VT    Zoey   2014 F         VT      F  2014    Zoey     10
             2015 F         VT      F  2015    Zoey     10
             2016 F         VT      F  2016    Zoey     12
             2017 F         VT      F  2017    Zoey      8
             2020 F         VT      F  2020    Zoey      9

[242303 rows x 5 columns]

In [226]:
babynames_index = babynames_index.unstack()
babynames_index

                  State      Gender         Year            Name        Count  \
Gender                F    M      F    M       F       M       F      M     F
State Name   Year
MA    Aaden  2008   NaN   MA    NaN    M     NaN  2008.0     NaN  Aaden   NaN
             2009   NaN   MA    NaN    M     NaN  2009.0     NaN  Aaden   NaN
             2012   NaN   MA    NaN    M     NaN  2012.0     NaN  Aaden   NaN
      Aadhya 2013    MA  NaN      F  NaN  2013.0     NaN  Aadhya    NaN   8.0
             2014    MA  NaN      F  NaN  2014.0     NaN  Aadhya    NaN   7.0
...                 ...  ...    ...  ...     ...     ...     ...    ...   ...
VT    Zoey   2014    VT  NaN      F  NaN  2014.0     NaN    Zoey    NaN  10.0
             2015    VT  NaN      F  NaN  2015.0     NaN    Zoey    NaN  10.0
             2016    VT  NaN      F  NaN  2016.0     NaN    Zoey    NaN  12.0
             2017    VT  NaN      F  NaN  2017.0     NaN    Zoey    NaN   8.0
             2020    VT  NaN      F  NaN  2020.0     NaN    Zoey    NaN   9.0


Gender                M
State Name   Year
MA    Aaden  2008  10.0
             2009  25.0
             2012   5.0
      Aadhya 2013   NaN
             2014   NaN
...                 ...
VT    Zoey   2014   NaN
             2015   NaN
             2016   NaN
             2017   NaN
             2020   NaN

[237485 rows x 10 columns]

In [227]:
babynames_index = babynames_index.unstack()
babynames_index

              State                                               ... Count  \
Gender            F                                               ...     M
Year           1910 1911 1912 1913 1914 1915 1916 1917 1918 1919  ...  2011
State Name                                                        ...
MA    Aaden     NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...   NaN
      Aadhya    NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...   NaN
      Aadi      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...   NaN
      Aadya     NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...   NaN
      Aaliyah   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...   NaN
...             ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...   ...
VT    Zander    NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...   5.0
      Zane      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...   NaN
      Zebulon   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...   NaN
      Zoe       NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...   NaN
      Zoey      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...   NaN


Gender
Year          2012 2013 2014 2015 2016 2017 2018 2019 2020
State Name
MA    Aaden    5.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
      Aadhya   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
      Aadi     NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
      Aadya    NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
      Aaliyah  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
...            ...  ...  ...  ...  ...  ...  ...  ...  ...
VT    Zander   NaN  NaN  NaN  5.0  NaN  NaN  NaN  NaN  NaN
      Zane     NaN  NaN  NaN  NaN  NaN  NaN  5.0  5.0  NaN
      Zebulon  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
      Zoe      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
      Zoey     NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN

[11030 rows x 1110 columns]

In [200]:
babynames_index = babynames_index.drop(["State", "Name", "Year", "Gender"], axis=1)
babynames_index

                          Count
State Name   Year Gender
MA    Aaden  2008 M          10
             2009 M          25
             2012 M           5
      Aadhya 2013 F           8
             2014 F           7
...                         ...
VT    Zoey   2014 F          10
             2015 F          10
             2016 F          12
             2017 F           8
             2020 F           9

[242303 rows x 1 columns]

In [ ]:
babynames_index = babynames_index.drop(["State", "Name", "Year", "Gender"], axis=1)
babynames_index

In [201]:
babynames_index.reset_index()

       State    Name  Year Gender  Count
0         MA   Aaden  2008      M     10
1         MA   Aaden  2009      M     25
2         MA   Aaden  2012      M      5
3         MA  Aadhya  2013      F      8
4         MA  Aadhya  2014      F      7
...      ...     ...   ...    ...    ...
242298    VT    Zoey  2014      F     10
242299    VT    Zoey  2015      F     10
242300    VT    Zoey  2016      F     12
242301    VT    Zoey  2017      F      8
242302    VT    Zoey  2020      F      9

[242303 rows x 5 columns]